;~ =============================================================================
;~ Rizonesoft Language File
;~ =============================================================================
;~ Date.........: 15 March 2025
;~ Author.......: Derick Payne (Rizonesoft)
;~ Link.........: https://rizonesoft.com
;~ =============================================================================

[Main]
Product = Firemin
Version = 12

[Language]
;~ Please ad the translated language name next to the English name. For example; Ελληνικά - Greek
Name = Magyar - Hungarian
Code = hu
Encoding = Unicode (UTF-16) LE BOM

[Translations]
;~ Please do not translate this section.
About = About
Custom = Custom
Donate = Donate
Menus = Menus
Messages = Messages
Messages2 = Messages2
Preferences = Preferences
Update = Update
Versioning = Versioning

[About]
Window_Title = %{Program.Name} névjegye
Label_Version = Verzió
Label_AutoIt = AutoIt verzióval készült
Label_Copyright = Szerzői jog
Tip_Title_Donate = Adományozzon ügyünknek
Tip_Message_Donate = Amikor adományoz, segít nekünk ingyenesen tartani szoftvereinket,\r\nés lehetővé teszi számunkra, hogy megszerezzük azokat az eszközöket\r\nés szolgáltatásokat, amelyeket az Ön szolgálatában használunk.
Label_Home = Kezdőlap
Label_License = Licenc
Label_Support = Segítség kérése
Tip_Title_Country = Dél-Afrikában készült
Tip_Message_Country = A %{Program.Name} Dél-Afrikában született.
Label_Contributors = Közreműködők
Button_Ok = OK
Label_RAM = (RAM) %d MB szabad a %d MB-ból (%d%%)
Label_HDD = (%s) %.2f GB szabad a %.2f GB-ból (%d%%)
Tip_Facebook = Kövessen minket a Facebookon.
Tip_GitHub = %{Program.Name} a GitHubon.

[Custom]
Label_Status_Welcome = Kezdje a böngésző betöltésével (válassza ki a fájlt).\r\nA %{Program.Name} automatikusan felismeri a folyamatot a kiválasztott futtatható fájlból.
Label_Status_Updates = Frissítések keresése
Group_Load_Browser = Böngésző betöltése
Label_Executable = Futtatható fájl útvonala (%s):
Label_Process_Usage = Használat | Csúcs:
Label_Process_Count = Folyamatok száma:
Button_Browse = &Tallózás
Group_Options = Beállítások
Checkbox_Reduce_Mem = Memória csökkentése minden:
Label_Milliseconds = ezredmásodperc
Checkbox_Reduce_Limit = Memória csökkentése, ha a használat meghaladja:
Checkbox_Start_With = %s indítása a %{Program.Name} indításakor
Checkbox_Enable_Extended_Processes = Kiterjesztett folyamatok engedélyezése
Button_Extended_Processes = &Kiterjesztett folyamatok
Checkbox_Start_Windows = %{Program.Name} indítása a Windows indításakor
Label_Settings_Updated = A beállítások sikeresen frissítve.
Button_Cancel = Mégse
Button_Save = Mentés
Time_Unit_01 = ezredmásodperc
Time_Unit_02 = másodperc
Time_Unit_03 = perc
Time_Unit_04 = óra
Label_Boost_Description = Csökkentés minden %s %s után, ha a használat meghaladja a %s MB-ot.
Title_Select_Browser = Böngésző kiválasztása
Tip_Minimized_Title = A %{Program.Name} még fut!
Tip_Minimized_Message = A %{Program.Name} továbbra is optimalizálja a %s memóriahasználatát.\r\nKattintson az értesítési területen lévő ikonra a különböző optimalizálási beállítások módosításához.
Label_Notice = A %{Program.Name} asztali és laptop számítógépekhez készült.\r\nSzerver környezetekhez a Firemin Server-t hoztuk létre. További információ...

[Donate]
Label_Heading = Mit szólna egy kis adományhoz, hogy szoftverünk örökre ingyenes maradhasson?
Label_Message = Kattintson az alábbi PayPal gombra, válasszon egy összeget és küldje el az adományt.\r\nAdománya segít fejleszteni szoftvereinket és mindent ingyenesen tartani a Rizonesoft-nál.\r\nEgy 20$-os adomány legalább egy hónapig segít minket működni.
Label_Donate = Fontolóra venne egy 10$-os adományt, hogy segítsen fejleszteni a %{Program.Name}-t és folytatni küldetésünket?

[Menus]
File = &Fájl
File_Preferences = &Beállítások
File_Close = &Kilépés\tShift+Alt+F4
Help = &Súgó
Help_Update = &Frissítések keresése
Help_Home = %{Company.Name} &kezdőlapja
Help_Downloads = &További letöltések
Help_Support = &Segítség kérése
Help_Issue = &Probléma jelentése
Help_Donate = &Adományozzon ügyünknek
Help_About = A %{Program.Name} névjegye
Tray_About = A %{Program.Name} %s névjegye
Tray_Open = %{Program.Name} megnyitása
Tray_Extended_Processes = Kiterjesztett folyamatok
Tray_Run = %s futtatása
Tray_Run_Safemode = %s futtatása csökkentett módban

[Messages]
Info_Title = Kérjük, vegye figyelembe
Warning_Title = Figyelem!
Error_Title = Hoppá! Valami hiba történt!
Error_Oops = Hoppá!
Singleton = A %{Program.Name} egy másik példánya már fut.\r\nTipp: Kattintson a %{Program.Name} ikonra az értesítési területen.
Compatible = A %{Program.Name} nem kompatibilis az Ön Windows verziójával.\r\nHa úgy gondolja, hogy ez hiba, kérjük, hagyjon üzenetet a '%s' oldalon minden részlettel.
Compatible_Bit = Sajnos a 32 bites %{Program.Name} nem kompatibilis az Ön Windows verziójával.\r\nKérjük, töltse le a 64 bites %{Program.Name}-t a '%s' oldalról.

[Preferences]
Window_Title = Beállítások
Tab_General = Általános
Tab_Performance = Teljesítmény
Tab_Language = Nyelv
Group_Notifications = Értesítések
Group_Extended_Processes = Kiterjesztett folyamatok
Group_Priority = Prioritás
Group_Memory = Memória
Group_Language = Nyelv
Checkbox_Notifications = Értesítések megjelenítése az értesítési területen
Label_Extended_Processes = Itt adja meg azokat a további folyamatneveket, amelyeket szeretné, hogy a %{Program.Name} optimalizáljon.\r\nA listát vesszővel kell elválasztani (Process01.exe, Process02.exe, stb.)
Label_SetPriority = Folyamat prioritásának beállítása:
Checkbox_SaveRealtime = Magas feletti prioritás mentése (nem ajánlott).
Checkbox_ReduceMemory = Memória csökkentése alacsony memóriájú rendszereken.
Label_Language_Message = Válassza ki a kívánt nyelvet, majd nyomja meg a %s gombot a folytatáshoz. (Újraindítás szükséges)
Button_Save = Mentés
Button_Cancel = Mégse
Label_Updated = Beállítások frissítve
MsgBox_Language_Title = Nyelv módosítva
MsgBox_Language_Message = A kiválasztott nyelv módosult.\r\nA %{Program.Name}-t újra kell indítani a választott nyelv érvénybe lépéséhez.
MsgBox_Closing_Title = %{Program.Name} bezárása
MsgBox_Closing_Message = Szeretné most bezárni a %{Program.Name}-t?

[Update]
Window_Title_Available = Frissítés elérhető
Window_Title_Congratulations = Gratulálunk!
Window_Title_Error = Valami hiba történt!
Label_Message_Update = A '%{Program.Name}' új verziója elérhető.
Label_Message_Latest = Ön a '%{Program.Name}' legújabb verzióját használja.
Label_Message_Error = Nem sikerült lekérni a '%{Program.Name}' legújabb verziójának információit.
Label_Message_Internet = Kérjük, ellenőrizze az internetkapcsolatát és próbálja újra.
Label_Build_Current = Jelenlegi verzió:
Label_Build_Update = Frissítési verzió:
CheckBox_NoUpdate = Ne keressen frissítéseket indításkor.
Button_Update = További információ
Button_Close = Bezárás

[Versioning]
Administrator = Rendszergazda
Build = Verzió
AutoIt_Version = AutoIt %{AutoIt.Version} verziót használ
Bit = bit